# IFCExporterService Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExternalServices..::..BuiltInExternalServices..::..IFCExporterService Property
ExternalServices..::..BuiltInExternalServices Class See Also
---
The external service which permits registration of an alternate implementation for IFC export.
**Namespace:** Autodesk.Revit.DB.ExternalService**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ExternalServiceId IFCExporterService { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property IFCExporterService As ExternalServiceId
	Get
```

Visual C++
---
```text
public:
static property ExternalServiceId^ IFCExporterService {
	ExternalServiceId^ get ();
}
```

# See Also
ExternalServices..::..BuiltInExternalServices Class
Autodesk.Revit.DB.ExternalService Namespace